__time__ = '2021/7/15'
__author__ = 'ZhiYong Sun'
__doc__ = '括号系列问题' \
          '20--判断括号是否有效' \
          '22--括号生成' \
          '32--最长有效括号' \
          '301--删除无效的括号' \
          '678--有效的括号字符串' \
          '856--括号的分数' \
          '921--使括号有效的最少添加' \
          '1021--删除最外层的括号' \
          '1096--花括号展开II' \
          '1111--有效括号的嵌套深度' \
          '1190. 反转每对括号间的子串' \
          '1249--移除无效的括号' \
          '1541--平衡括号字符串的最少插入次数' \
          '1614--括号的最大嵌套深度' \
          '1807--替换字符串中的括号内容'



if __name__ == "__main__":
